/* 
运算符 ：
    1. 算术运算符
          + - * / %
    2. 关系运算符
        > >= < <= != ==
    3. 逻辑运算符
        ! && ||
         与运算一假则假，或运算一真则真，非运算真假倒置

         非0是真  0是假
         假用0表示
         真用1表示

    4. 赋值运算符
        = += *= /= -= 
    
    优先级别
        算术 > 关系  > 逻辑 > 赋值

 */

# include <stdio.h>

int main(void){
    int i = 10;
    int k = 20;
    int m;
    // m = (3>2) && (k=5);
     m = (1>2) && (k=5);//短路
    //  m = (1>2) & (k=5);//非短路
    printf("m = %d, k = %d\n", m,k);
    return 0;
}



